Autodesk.Revit.DB.Events.WorksharedOperationProgressChangedEventArgs.Location
Full path of the central model which is to be operated.
Remarks:
For C4R model, it looks like 'Cloud Model://My project/my model.rvt'.
Since:
2017 Subscription Update